In [19]:
import pandas as pd
df = pd.read_csv('student.csv')
df

  Name  Marks    City
0    A   34.0     Ngp
1    B    NaN    Pune
2    C   78.0     NaN
3    D   90.0  mumbai
4    E    NaN   Delhi

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Marks   3 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [21]:
df.isnull()

    Name  Marks   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
4  False   True  False

In [ ]:
df["Marks"].fillna(df["Marks"].mean(),inspace = True)
df["City"].fillna("Unknown",inspace = True)
df

TypeError: NDFrame.fillna() got an unexpected keyword argument 'inspace'. Did you mean 'inplace'?